{"publications":
	[
		{
		"id":"CCIS2011",
		"title":"Evaluating Dynamic Ontologies",
		"publication_date":"Forthcoming",
		"summary":"Book chapter expanding upon the KEOD 2010 paper, describing two novel methods for evaluating dynamic ontologies and visualization techniques.",	
		"abstract":"Ontology evaluation poses a number of difficult challenges requiring different evaluation methodologies, particularly for a \"dynamic ontology\" generated by a combination of automatic and semi-automatic methods. We review evaluation methods that focus solely on syntactic (formal) correctness, on the preservation of semantic structure, or on pragmatic utility. We propose two novel methods for dynamic ontology evaluation and describe the use of these methods for evaluating the different taxonomic representations that are generated at diﬀerent times or with diﬀerent amounts of expert feedback. These methods are then applied to the Indiana Philosophy Ontology (InPhO), and used to guide the ontology enrichment process.",
		"fulltext":"/papers/2011MurdockBucknerAllen.pdf",
		"authors":"Jaimie Murdock, Cameron Buckner, Colin Allen", 
		"publisher":"Springer-Verlag"
		},
		{
		"id":"JDHCS2011",
		"title":"InPhO for All: Why APIs Matter",
		"publication_date":"2011",
		"summary":"Details the importance of APIs for the Digital Humanities scholar, along with the design decisions made for the RESTful InPhO API.",	
		"abstract":"The unique convergence of humanities scholars, computer scientists, librarians, and information scientists in digital humanities projects highlights the collaborative opportunities such research entails. The digital humanities aspire to create, maintain, and deploy high integrity metadata that are derived from the activities and feedback of domain experts in the humanities, to support scholarly activities in the humanities which meet the high standards of academic peer review. Unfortunately, the relatively limited human resources committed to many digital projects for the humanities have led to unwieldy initial implementations and underutilization of semantic web technology, with the result that most projects in the digital humanities are standalone projects whose data cannot easily be integrated with others. In addition to the barriers arising from idiosyncratic implementations, the difficulties of integrating data from multiple sources are compounded by the use of standards that serve one particular purpose well but do not facilitate other kinds of scholarly activities, often making the combination of resources from different projects laborious and expensive. Thus, much of the potential for collaboration in the digital humanities still remains to be unlocked.",
		"fulltext":"/papers/2011JDHCSMurdockAllen.pdf",
		"authors":"Jaimie Murdock, Colin Allen", 
		"publisher":"Journal of the Chicago Colloquium of Digital Humanities and Computer Science, Evanston, Illinois"
		}
	]
}
			
				
				      